CRUD-general-purpose/2024/ranking_08-2024_couchbase-ee-761-vanilla-medium-medium-msazure_0_MaSlOXoa/0_run.txt
bin/ycsb run couchbase3 -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p couchbase.host=10.10.0.7,10.10.0.10,10.10.0.9 -p couchbase.bucket=ycsb -p couchbase.password=Performance99 -p couchbase.username=ycsb -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=5000001
/usr/lib/jvm/java-1.8.0-openjdk-amd64/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/couchbase3-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/couchbase3-binding/lib/rxjava-reactive-streams-1.2.1.jar:/binary/ycsb/couchbase3-binding/lib/reactor-extra-3.4.8.jar:/binary/ycsb/couchbase3-binding/lib/couchbase3-binding-0.18.0-SNAPSHOT.jar:/binary/ycsb/couchbase3-binding/lib/logback-classic-1.2.11.jar:/binary/ycsb/couchbase3-binding/lib/java-client-3.4.6.jar:/binary/ycsb/couchbase3-binding/lib/reactive-streams-1.0.3.jar:/binary/ycsb/couchbase3-binding/lib/reactor-core-3.4.18.jar:/binary/ycsb/couchbase3-binding/lib/reactor-adapter-3.4.8.jar:/binary/ycsb/couchbase3-binding/lib/rxjava-1.2.2.jar:/binary/ycsb/couchbase3-binding/lib/logback-core-1.2.11.jar:/binary/ycsb/couchbase3-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/couchbase3-binding/lib/core-io-2.4.6.jar:/binary/ycsb/couchbase3-binding/lib/couchbase-transactions-1.2.4.jar site.ycsb.Client -db site.ycsb.db.couchbase3.Couchbase3Client -s -p couchbase.host=10.10.0.7,10.10.0.10,10.10.0.9 -p couchbase.bucket=ycsb -p couchbase.password=Performance99 -p couchbase.username=ycsb -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=5000001 -t
Command line: -db site.ycsb.db.couchbase3.Couchbase3Client -s -p couchbase.host=10.10.0.7,10.10.0.10,10.10.0.9 -p couchbase.bucket=ycsb -p couchbase.password=Performance99 -p couchbase.username=ycsb -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=5000001 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-08-28 11:08:09:429 0 sec: 0 operations; est completion in 0 second 
Maximum execution time specified as: 1800 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-08-28 11:08:19:429 10 sec: 323 operations; 32.3 current ops/sec; est completion in 19 days 8 hours [READ: Count=117, Max=291839, Min=1072, Avg=43075.56, 90=132095, 99=263423, 99.9=291839, 99.99=291839] [INSERT: Count=206, Max=2054143, Min=628, Avg=447119.02, 90=2015231, 99=2053119, 99.9=2054143, 99.99=2054143] 
2024-08-28 11:08:29:428 20 sec: 1310 operations; 98.7 current ops/sec; est completion in 9 days 13 hours [READ: Count=500, Max=90367, Min=443, Avg=12688.18, 90=24415, 99=66431, 99.9=90367, 99.99=90367] [INSERT: Count=487, Max=99391, Min=413, Avg=3724.37, 90=7959, 99=41343, 99.9=99391, 99.99=99391] 
2024-08-28 11:08:39:428 30 sec: 4850 operations; 354 current ops/sec; est completion in 3 days 20 hours [READ: Count=1765, Max=140671, Min=352, Avg=14164.3, 90=25487, 99=89471, 99.9=132223, 99.99=140671] [INSERT: Count=1777, Max=87295, Min=327, Avg=3261.87, 90=7971, 99=51263, 99.9=80767, 99.99=87295] 
2024-08-28 11:08:49:428 40 sec: 23029 operations; 1817.9 current ops/sec; est completion in 1 day 2 hours [READ: Count=8987, Max=130687, Min=245, Avg=11067.93, 90=23615, 99=75519, 99.9=108735, 99.99=114943] [INSERT: Count=9196, Max=135167, Min=265, Avg=3713.08, 90=9079, 99=40543, 99.9=84863, 99.99=116991] 
2024-08-28 11:08:59:428 50 sec: 122973 operations; 9994.4 current ops/sec; est completion in 6 hours 5 minutes [READ: Count=49735, Max=75327, Min=221, Avg=4869.36, 90=12039, 99=24879, 99.9=42751, 99.99=59391] [INSERT: Count=50242, Max=56095, Min=247, Avg=2708.49, 90=7607, 99=16463, 99.9=31487, 99.99=50111] 
2024-08-28 11:09:09:428 60 sec: 497175 operations; 37420.2 current ops/sec; est completion in 1 hour 47 minutes [READ: Count=186671, Max=29231, Min=213, Avg=2381.48, 90=4991, 99=9167, 99.9=16095, 99.99=19215] [INSERT: Count=187541, Max=25103, Min=235, Avg=2040.57, 90=4631, 99=8791, 99.9=16263, 99.99=19375] 
2024-08-28 11:09:19:428 70 sec: 929551 operations; 43237.6 current ops/sec; est completion in 1 hour 6 minutes [READ: Count=216081, Max=21391, Min=200, Avg=2539.15, 90=5727, 99=8719, 99.9=17263, 99.99=20399] [INSERT: Count=216322, Max=21359, Min=236, Avg=2024.45, 90=5239, 99=8367, 99.9=16751, 99.99=20095] 
2024-08-28 11:09:29:428 80 sec: 1368847 operations; 43929.6 current ops/sec; est completion in 51 minutes [READ: Count=219578, Max=27279, Min=219, Avg=2375.23, 90=5815, 99=9135, 99.9=18431, 99.99=23967] [INSERT: Count=219682, Max=27439, Min=232, Avg=2140.57, 90=5451, 99=8871, 99.9=17679, 99.99=23071] 
2024-08-28 11:09:39:428 90 sec: 1774355 operations; 40550.8 current ops/sec; est completion in 44 minutes [READ: Count=202959, Max=22975, Min=210, Avg=2527.49, 90=6667, 99=10487, 99.9=17119, 99.99=21599] [INSERT: Count=202574, Max=23119, Min=236, Avg=2378.75, 90=6515, 99=10479, 99.9=16959, 99.99=22111] 
2024-08-28 11:09:49:428 100 sec: 2198777 operations; 42442.2 current ops/sec; est completion in 39 minutes [READ: Count=212109, Max=26399, Min=210, Avg=2433.76, 90=6151, 99=10143, 99.9=17599, 99.99=21263] [INSERT: Count=212316, Max=26479, Min=235, Avg=2258.23, 90=5915, 99=9855, 99.9=17551, 99.99=22639] 
2024-08-28 11:09:59:428 110 sec: 2622956 operations; 42417.9 current ops/sec; est completion in 35 minutes [READ: Count=212154, Max=25407, Min=211, Avg=2414.91, 90=6051, 99=9447, 99.9=17887, 99.99=22191] [INSERT: Count=212004, Max=25487, Min=241, Avg=2282.74, 90=5855, 99=9351, 99.9=17567, 99.99=21327] 
2024-08-28 11:10:09:428 120 sec: 3047900 operations; 42494.4 current ops/sec; est completion in 33 minutes [READ: Count=211921, Max=21951, Min=202, Avg=2393.01, 90=6127, 99=9719, 99.9=17967, 99.99=20879] [INSERT: Count=213026, Max=22031, Min=239, Avg=2296.84, 90=6015, 99=9711, 99.9=17935, 99.99=20783] 
2024-08-28 11:10:19:428 130 sec: 3492136 operations; 44423.6 current ops/sec; est completion in 31 minutes [READ: Count=222116, Max=136831, Min=218, Avg=2283.94, 90=5683, 99=10327, 99.9=19759, 99.99=133119] [INSERT: Count=222178, Max=136831, Min=237, Avg=2204.28, 90=5495, 99=10151, 99.9=19263, 99.99=132735] 
2024-08-28 11:10:29:428 140 sec: 3926343 operations; 43420.7 current ops/sec; est completion in 29 minutes [READ: Count=217399, Max=26495, Min=215, Avg=2323.4, 90=5811, 99=9799, 99.9=19423, 99.99=24959] [INSERT: Count=216748, Max=26687, Min=236, Avg=2270.4, 90=5739, 99=9751, 99.9=19375, 99.99=24943] 
2024-08-28 11:10:39:428 150 sec: 4362046 operations; 43570.3 current ops/sec; est completion in 28 minutes [READ: Count=217508, Max=30847, Min=216, Avg=2301.91, 90=5827, 99=9015, 99.9=18463, 99.99=25167] [INSERT: Count=218180, Max=30719, Min=241, Avg=2276.35, 90=5775, 99=9055, 99.9=18191, 99.99=25263] 
2024-08-28 11:10:49:428 160 sec: 4786779 operations; 42473.3 current ops/sec; est completion in 27 minutes [READ: Count=212037, Max=28559, Min=200, Avg=2338.82, 90=6119, 99=10071, 99.9=19567, 99.99=25231] [INSERT: Count=212712, Max=28479, Min=233, Avg=2359.67, 90=6167, 99=10231, 99.9=19839, 99.99=25919] 
2024-08-28 11:10:59:428 170 sec: 5219710 operations; 43293.1 current ops/sec; est completion in 26 minutes [READ: Count=216595, Max=22159, Min=208, Avg=2303.72, 90=6175, 99=10319, 99.9=16671, 99.99=20271] [INSERT: Count=216339, Max=22223, Min=238, Avg=2306.72, 90=6187, 99=10407, 99.9=16479, 99.99=19967] 
2024-08-28 11:11:09:428 180 sec: 5673624 operations; 45391.4 current ops/sec; est completion in 25 minutes [READ: Count=226719, Max=27487, Min=213, Avg=2170.11, 90=5495, 99=9127, 99.9=17423, 99.99=23807] [INSERT: Count=227213, Max=27567, Min=234, Avg=2227.1, 90=5635, 99=9327, 99.9=17503, 99.99=24367] 
2024-08-28 11:11:19:428 190 sec: 6110713 operations; 43708.9 current ops/sec; est completion in 24 minutes [READ: Count=218610, Max=24431, Min=210, Avg=2246.3, 90=5603, 99=9335, 99.9=18863, 99.99=22303] [INSERT: Count=218450, Max=24575, Min=229, Avg=2320.67, 90=5755, 99=9543, 99.9=19375, 99.99=23103] 
2024-08-28 11:11:29:428 200 sec: 6561051 operations; 45033.8 current ops/sec; est completion in 24 minutes [READ: Count=225603, Max=25647, Min=210, Avg=2183.19, 90=5995, 99=10135, 99.9=19311, 99.99=23055] [INSERT: Count=224746, Max=26671, Min=239, Avg=2249.48, 90=6159, 99=10479, 99.9=19679, 99.99=23903] 
2024-08-28 11:11:39:428 210 sec: 6996027 operations; 43497.6 current ops/sec; est completion in 23 minutes [READ: Count=217325, Max=28191, Min=213, Avg=2259.17, 90=5995, 99=10191, 99.9=17295, 99.99=23151] [INSERT: Count=217634, Max=28239, Min=233, Avg=2330.56, 90=6131, 99=10367, 99.9=17279, 99.99=22783] 
2024-08-28 11:11:49:428 220 sec: 7450863 operations; 45483.6 current ops/sec; est completion in 22 minutes [READ: Count=226846, Max=29743, Min=207, Avg=2158.6, 90=5623, 99=10503, 99.9=17023, 99.99=24431] [INSERT: Count=227977, Max=30047, Min=235, Avg=2229.58, 90=5779, 99=10935, 99.9=17439, 99.99=24143] 
2024-08-28 11:11:59:428 230 sec: 7883835 operations; 43297.2 current ops/sec; est completion in 22 minutes [READ: Count=216552, Max=24591, Min=200, Avg=2283.35, 90=5747, 99=9735, 99.9=17311, 99.99=20767] [INSERT: Count=216440, Max=24687, Min=233, Avg=2327.84, 90=5843, 99=9951, 99.9=17327, 99.99=20815] 
2024-08-28 11:12:09:428 240 sec: 8334516 operations; 45068.1 current ops/sec; est completion in 21 minutes [READ: Count=225789, Max=28111, Min=210, Avg=2183.62, 90=5659, 99=9567, 99.9=16687, 99.99=23855] [INSERT: Count=224922, Max=28111, Min=242, Avg=2246.75, 90=5779, 99=9647, 99.9=16511, 99.99=24335] 
2024-08-28 11:12:19:428 250 sec: 8758223 operations; 42370.7 current ops/sec; est completion in 21 minutes [READ: Count=211788, Max=25247, Min=209, Avg=2305.67, 90=6139, 99=10319, 99.9=18943, 99.99=24271] [INSERT: Count=211945, Max=25551, Min=231, Avg=2407.23, 90=6315, 99=10711, 99.9=19615, 99.99=24143] 
2024-08-28 11:12:29:428 260 sec: 9203906 operations; 44568.3 current ops/sec; est completion in 21 minutes [READ: Count=222605, Max=27615, Min=210, Avg=2201.7, 90=5831, 99=9727, 99.9=20127, 99.99=25375] [INSERT: Count=223054, Max=27599, Min=230, Avg=2278.73, 90=5999, 99=9983, 99.9=20703, 99.99=25871] 
2024-08-28 11:12:39:428 270 sec: 9623202 operations; 41929.6 current ops/sec; est completion in 20 minutes [READ: Count=209196, Max=24095, Min=201, Avg=2338.7, 90=6311, 99=10479, 99.9=18015, 99.99=22143] [INSERT: Count=210077, Max=24111, Min=237, Avg=2423.14, 90=6471, 99=10631, 99.9=17967, 99.99=21711] 
2024-08-28 11:12:49:428 280 sec: 10054541 operations; 43133.9 current ops/sec; est completion in 20 minutes [READ: Count=215000, Max=21055, Min=204, Avg=2277.31, 90=6099, 99=9807, 99.9=16847, 99.99=20031] [INSERT: Count=216325, Max=21375, Min=245, Avg=2352.09, 90=6243, 99=9887, 99.9=16623, 99.99=19839] 
2024-08-28 11:12:59:428 290 sec: 10485021 operations; 43048 current ops/sec; est completion in 20 minutes [READ: Count=215055, Max=20079, Min=202, Avg=2277.78, 90=6183, 99=10207, 99.9=16159, 99.99=18959] [INSERT: Count=215444, Max=20031, Min=241, Avg=2361.15, 90=6343, 99=10383, 99.9=16191, 99.99=18863] 
2024-08-28 11:13:09:428 300 sec: 10930862 operations; 44584.1 current ops/sec; est completion in 19 minutes [READ: Count=222695, Max=23583, Min=211, Avg=2202.82, 90=5539, 99=10151, 99.9=17743, 99.99=21695] [INSERT: Count=223124, Max=23535, Min=242, Avg=2276.08, 90=5719, 99=10495, 99.9=17951, 99.99=21695] 
2024-08-28 11:13:19:428 310 sec: 11362871 operations; 43200.9 current ops/sec; est completion in 19 minutes [READ: Count=215977, Max=21871, Min=215, Avg=2285.04, 90=5775, 99=10367, 99.9=17615, 99.99=21007] [INSERT: Count=216022, Max=21887, Min=246, Avg=2338.29, 90=5887, 99=10375, 99.9=17519, 99.99=20943] 
2024-08-28 11:13:29:428 320 sec: 11803070 operations; 44019.9 current ops/sec; est completion in 19 minutes [READ: Count=219804, Max=23583, Min=201, Avg=2236.98, 90=5583, 99=9615, 99.9=17231, 99.99=21007] [INSERT: Count=220416, Max=23567, Min=237, Avg=2300.1, 90=5703, 99=9791, 99.9=17567, 99.99=21967] 
2024-08-28 11:13:39:428 330 sec: 12248508 operations; 44543.8 current ops/sec; est completion in 18 minutes [READ: Count=222939, Max=26639, Min=216, Avg=2209.12, 90=5499, 99=8831, 99.9=17647, 99.99=24991] [INSERT: Count=222483, Max=26495, Min=240, Avg=2274.15, 90=5643, 99=8927, 99.9=17471, 99.99=23663] 
2024-08-28 11:13:49:428 340 sec: 12701456 operations; 45294.8 current ops/sec; est completion in 18 minutes [READ: Count=226605, Max=23679, Min=213, Avg=2171.53, 90=5607, 99=9583, 99.9=17679, 99.99=21183] [INSERT: Count=226350, Max=23759, Min=235, Avg=2237.04, 90=5743, 99=9735, 99.9=17839, 99.99=21359] 
2024-08-28 11:13:59:428 350 sec: 13143870 operations; 44241.4 current ops/sec; est completion in 18 minutes [READ: Count=221501, Max=25135, Min=206, Avg=2222.34, 90=5819, 99=9487, 99.9=16831, 99.99=21391] [INSERT: Count=220964, Max=25359, Min=239, Avg=2291.9, 90=5951, 99=9687, 99.9=17039, 99.99=21295] 
2024-08-28 11:14:09:428 360 sec: 13580837 operations; 43696.7 current ops/sec; est completion in 17 minutes [READ: Count=218153, Max=26351, Min=201, Avg=2240.67, 90=5927, 99=10127, 99.9=18047, 99.99=22367] [INSERT: Count=218761, Max=26431, Min=233, Avg=2330.1, 90=6099, 99=10359, 99.9=18191, 99.99=22703] 
2024-08-28 11:14:19:428 370 sec: 14022199 operations; 44136.2 current ops/sec; est completion in 17 minutes [READ: Count=220413, Max=27055, Min=210, Avg=2218.69, 90=5543, 99=10015, 99.9=18239, 99.99=22943] [INSERT: Count=220952, Max=26943, Min=238, Avg=2306.36, 90=5703, 99=10191, 99.9=18399, 99.99=23471] 
2024-08-28 11:14:29:428 380 sec: 14467922 operations; 44572.3 current ops/sec; est completion in 17 minutes [READ: Count=222797, Max=32319, Min=212, Avg=2203.99, 90=5587, 99=10119, 99.9=18271, 99.99=29615] [INSERT: Count=222973, Max=32831, Min=236, Avg=2277.43, 90=5731, 99=10455, 99.9=18367, 99.99=29663] 
2024-08-28 11:14:39:428 390 sec: 14925860 operations; 45793.8 current ops/sec; est completion in 17 minutes [READ: Count=228845, Max=24319, Min=211, Avg=2142.3, 90=5379, 99=9615, 99.9=16655, 99.99=22111] [INSERT: Count=229048, Max=24319, Min=235, Avg=2214.91, 90=5535, 99=9743, 99.9=16895, 99.99=22431] 
2024-08-28 11:14:49:428 400 sec: 15388708 operations; 46284.8 current ops/sec; est completion in 16 minutes [READ: Count=231398, Max=25759, Min=202, Avg=2114.63, 90=5407, 99=10351, 99.9=17151, 99.99=25055] [INSERT: Count=231455, Max=25887, Min=231, Avg=2203.54, 90=5619, 99=10703, 99.9=17311, 99.99=24991] 
2024-08-28 11:14:59:428 410 sec: 15839880 operations; 45117.2 current ops/sec; est completion in 16 minutes [READ: Count=225557, Max=23407, Min=204, Avg=2174.43, 90=6011, 99=10799, 99.9=18255, 99.99=22207] [INSERT: Count=225598, Max=23295, Min=243, Avg=2253.08, 90=6183, 99=11039, 99.9=18287, 99.99=22399] 
2024-08-28 11:15:09:428 420 sec: 16294177 operations; 45429.7 current ops/sec; est completion in 16 minutes [READ: Count=227070, Max=24191, Min=200, Avg=2155.11, 90=5675, 99=10303, 99.9=16975, 99.99=19615] [INSERT: Count=227237, Max=24191, Min=232, Avg=2241.9, 90=5819, 99=10591, 99.9=17167, 99.99=19679] 
2024-08-28 11:15:19:428 430 sec: 16741721 operations; 44754.4 current ops/sec; est completion in 15 minutes [READ: Count=223774, Max=25391, Min=208, Avg=2199.75, 90=5403, 99=10207, 99.9=19183, 99.99=23503] [INSERT: Count=223787, Max=25727, Min=230, Avg=2263.49, 90=5507, 99=10519, 99.9=19679, 99.99=23455] 
2024-08-28 11:15:29:428 440 sec: 17200388 operations; 45866.7 current ops/sec; est completion in 15 minutes [READ: Count=229269, Max=23279, Min=205, Avg=2164.3, 90=5355, 99=9759, 99.9=18463, 99.99=22255] [INSERT: Count=229393, Max=23359, Min=233, Avg=2190.45, 90=5403, 99=9951, 99.9=18383, 99.99=22191] 
2024-08-28 11:15:39:428 450 sec: 17646668 operations; 44628 current ops/sec; est completion in 15 minutes [READ: Count=223076, Max=24415, Min=198, Avg=2228.41, 90=5739, 99=9775, 99.9=17919, 99.99=21583] [INSERT: Count=223218, Max=24287, Min=231, Avg=2247.47, 90=5771, 99=9903, 99.9=17727, 99.99=21407] 
2024-08-28 11:15:49:428 460 sec: 18068646 operations; 42197.8 current ops/sec; est completion in 15 minutes [READ: Count=211650, Max=26639, Min=212, Avg=2354.34, 90=6351, 99=10807, 99.9=18911, 99.99=23695] [INSERT: Count=210308, Max=26591, Min=245, Avg=2379.81, 90=6367, 99=11007, 99.9=18735, 99.99=23775] 
2024-08-28 11:15:59:428 470 sec: 18510446 operations; 44180 current ops/sec; est completion in 15 minutes [READ: Count=220741, Max=25279, Min=205, Avg=2256.8, 90=5855, 99=10135, 99.9=17471, 99.99=21487] [INSERT: Count=221097, Max=25199, Min=236, Avg=2264.53, 90=5879, 99=10271, 99.9=17615, 99.99=21615] 
2024-08-28 11:16:09:429 480 sec: 18946655 operations; 43616.54 current ops/sec; est completion in 14 minutes [READ: Count=218013, Max=25439, Min=195, Avg=2281.89, 90=6047, 99=9863, 99.9=17279, 99.99=22719] [INSERT: Count=218151, Max=25391, Min=240, Avg=2297.5, 90=6099, 99=9991, 99.9=17231, 99.99=22447] 
2024-08-28 11:16:19:428 490 sec: 19464371 operations; 51776.78 current ops/sec; est completion in 14 minutes [READ: Count=259374, Max=23823, Min=204, Avg=1917.39, 90=4959, 99=9319, 99.9=18159, 99.99=21663] [INSERT: Count=258366, Max=23839, Min=238, Avg=1940.27, 90=4995, 99=9527, 99.9=18271, 99.99=21951] 
2024-08-28 11:16:29:428 500 sec: 19953525 operations; 48915.4 current ops/sec; est completion in 14 minutes [READ: Count=244388, Max=23423, Min=211, Avg=2033.85, 90=5127, 99=9127, 99.9=17103, 99.99=22143] [INSERT: Count=244764, Max=23471, Min=237, Avg=2049.99, 90=5147, 99=9143, 99.9=16959, 99.99=22127] 
2024-08-28 11:16:39:428 510 sec: 20472382 operations; 51885.7 current ops/sec; est completion in 13 minutes [READ: Count=258693, Max=21903, Min=210, Avg=1916.41, 90=4611, 99=9223, 99.9=17423, 99.99=20911] [INSERT: Count=260106, Max=21871, Min=235, Avg=1930.25, 90=4611, 99=9327, 99.9=17455, 99.99=20815] 
2024-08-28 11:16:49:428 520 sec: 20933287 operations; 46090.5 current ops/sec; est completion in 13 minutes [READ: Count=231136, Max=24655, Min=200, Avg=2163.97, 90=5611, 99=10663, 99.9=18015, 99.99=22703] [INSERT: Count=229804, Max=24623, Min=239, Avg=2170.72, 90=5595, 99=10703, 99.9=18063, 99.99=22735] 
2024-08-28 11:16:59:428 530 sec: 21414317 operations; 48103 current ops/sec; est completion in 13 minutes [READ: Count=240395, Max=21391, Min=214, Avg=2065.61, 90=5199, 99=9983, 99.9=17455, 99.99=20447] [INSERT: Count=240637, Max=21327, Min=238, Avg=2088.28, 90=5223, 99=10063, 99.9=17359, 99.99=20479] 
2024-08-28 11:17:09:428 540 sec: 21919961 operations; 50564.4 current ops/sec; est completion in 13 minutes [READ: Count=252421, Max=27647, Min=198, Avg=1969.21, 90=5195, 99=9343, 99.9=18591, 99.99=26639] [INSERT: Count=253215, Max=27743, Min=227, Avg=1981.04, 90=5215, 99=9487, 99.9=19007, 99.99=26863] 
2024-08-28 11:17:19:428 550 sec: 22392307 operations; 47234.6 current ops/sec; est completion in 12 minutes [READ: Count=236467, Max=22271, Min=208, Avg=2116.11, 90=5551, 99=9359, 99.9=17359, 99.99=21615] [INSERT: Count=235884, Max=22271, Min=244, Avg=2113.18, 90=5539, 99=9431, 99.9=17439, 99.99=21839] 
2024-08-28 11:17:29:428 560 sec: 22901397 operations; 50909 current ops/sec; est completion in 12 minutes [READ: Count=254573, Max=20191, Min=200, Avg=1947.39, 90=4747, 99=9143, 99.9=16327, 99.99=18207] [INSERT: Count=254521, Max=20223, Min=239, Avg=1975.57, 90=4795, 99=9295, 99.9=16479, 99.99=18879] 
2024-08-28 11:17:39:428 570 sec: 23427598 operations; 52620.1 current ops/sec; est completion in 12 minutes [READ: Count=262426, Max=26879, Min=203, Avg=1894.55, 90=4455, 99=8783, 99.9=17039, 99.99=26287] [INSERT: Count=263800, Max=26959, Min=228, Avg=1901.81, 90=4467, 99=8775, 99.9=17071, 99.99=26335] 
2024-08-28 11:17:49:428 580 sec: 24002921 operations; 57532.3 current ops/sec; est completion in 12 minutes [READ: Count=287832, Max=21199, Min=203, Avg=1728.72, 90=4107, 99=8655, 99.9=17679, 99.99=20191] [INSERT: Count=287469, Max=21375, Min=229, Avg=1742.24, 90=4119, 99=8655, 99.9=17567, 99.99=20559] 
2024-08-28 11:17:59:428 590 sec: 24603755 operations; 60083.4 current ops/sec; est completion in 11 minutes [READ: Count=300467, Max=24511, Min=199, Avg=1648.65, 90=3907, 99=8527, 99.9=17183, 99.99=23535] [INSERT: Count=300365, Max=24495, Min=226, Avg=1675.21, 90=3993, 99=8631, 99.9=17151, 99.99=23711] 
2024-08-28 11:18:09:428 600 sec: 25191039 operations; 58728.4 current ops/sec; est completion in 11 minutes [READ: Count=293441, Max=30303, Min=205, Avg=1684.13, 90=3863, 99=9151, 99.9=17327, 99.99=29455] [INSERT: Count=293867, Max=30303, Min=237, Avg=1716.41, 90=3931, 99=9455, 99.9=17359, 99.99=29503] 
2024-08-28 11:18:19:428 610 sec: 25803798 operations; 61275.9 current ops/sec; est completion in 11 minutes [READ: Count=306377, Max=22671, Min=205, Avg=1612.06, 90=3783, 99=8727, 99.9=17711, 99.99=21311] [INSERT: Count=306362, Max=22799, Min=233, Avg=1647.21, 90=3853, 99=8919, 99.9=17967, 99.99=21487] 
2024-08-28 11:18:29:428 620 sec: 26326593 operations; 52279.5 current ops/sec; est completion in 10 minutes [READ: Count=261125, Max=252031, Min=200, Avg=1913.67, 90=4351, 99=10447, 99.9=19455, 99.99=179839] [INSERT: Count=261725, Max=171903, Min=231, Avg=1906.96, 90=4379, 99=10719, 99.9=19199, 99.99=167167] 
2024-08-28 11:18:39:428 630 sec: 26936006 operations; 60941.3 current ops/sec; est completion in 10 minutes [READ: Count=304416, Max=149119, Min=203, Avg=1631.76, 90=3661, 99=8855, 99.9=18447, 99.99=25679] [INSERT: Count=304962, Max=25983, Min=230, Avg=1645.25, 90=3693, 99=8855, 99.9=18575, 99.99=24255] 
2024-08-28 11:18:49:428 640 sec: 27497048 operations; 56104.2 current ops/sec; est completion in 10 minutes [READ: Count=280827, Max=49759, Min=194, Avg=1772.83, 90=4139, 99=10031, 99.9=18447, 99.99=27983] [INSERT: Count=280199, Max=32143, Min=231, Avg=1787.02, 90=4131, 99=10087, 99.9=18655, 99.99=28431] 
2024-08-28 11:18:59:428 650 sec: 28028602 operations; 53155.4 current ops/sec; est completion in 10 minutes [READ: Count=265678, Max=124607, Min=211, Avg=1865.77, 90=4503, 99=9447, 99.9=17215, 99.99=24975] [INSERT: Count=265829, Max=23103, Min=241, Avg=1849.92, 90=4439, 99=9343, 99.9=17327, 99.99=22095] 
2024-08-28 11:19:09:428 660 sec: 28496390 operations; 46778.8 current ops/sec; est completion in 9 minutes [READ: Count=234217, Max=375551, Min=199, Avg=2228.02, 90=5003, 99=10039, 99.9=49951, 99.99=338175] [INSERT: Count=233571, Max=328447, Min=238, Avg=2087.43, 90=4931, 99=9671, 99.9=21759, 99.99=326911] 
2024-08-28 11:19:19:428 670 sec: 28955351 operations; 45896.1 current ops/sec; est completion in 9 minutes [READ: Count=229214, Max=96511, Min=200, Avg=2166.88, 90=5115, 99=10015, 99.9=18383, 99.99=23071] [INSERT: Count=229774, Max=26031, Min=237, Avg=2188.71, 90=5151, 99=10167, 99.9=18575, 99.99=22991] 
2024-08-28 11:19:29:428 680 sec: 29443107 operations; 48775.6 current ops/sec; est completion in 9 minutes [READ: Count=243629, Max=37215, Min=209, Avg=2044.75, 90=4879, 99=9223, 99.9=17679, 99.99=35359] [INSERT: Count=244112, Max=36735, Min=243, Avg=2049.82, 90=4875, 99=9135, 99.9=17855, 99.99=35295] 
2024-08-28 11:19:39:428 690 sec: 29922363 operations; 47925.6 current ops/sec; est completion in 9 minutes [READ: Count=239072, Max=380927, Min=217, Avg=2122.56, 90=5011, 99=10479, 99.9=19151, 99.99=310271] [INSERT: Count=240225, Max=301567, Min=234, Avg=2046.94, 90=4975, 99=10383, 99.9=18127, 99.99=298239] 
2024-08-28 11:19:49:428 700 sec: 30415068 operations; 49270.5 current ops/sec; est completion in 9 minutes [READ: Count=246401, Max=24079, Min=211, Avg=2019.4, 90=4799, 99=10159, 99.9=16911, 99.99=21807] [INSERT: Count=246282, Max=24047, Min=236, Avg=2034.8, 90=4839, 99=10223, 99.9=16831, 99.99=21791] 
2024-08-28 11:19:59:428 710 sec: 30902191 operations; 48712.3 current ops/sec; est completion in 8 minutes [READ: Count=243658, Max=29679, Min=209, Avg=2054.64, 90=5163, 99=10343, 99.9=19647, 99.99=26287] [INSERT: Count=243437, Max=29471, Min=236, Avg=2045.54, 90=5143, 99=10191, 99.9=19647, 99.99=26479] 
2024-08-28 11:20:09:431 720 sec: 31287315 operations; 38504.7 current ops/sec; est completion in 8 minutes [READ: Count=192112, Max=390399, Min=214, Avg=2659.11, 90=6691, 99=10935, 99.9=21103, 99.99=363007] [INSERT: Count=193050, Max=341247, Min=238, Avg=2531.96, 90=6667, 99=10703, 99.9=17967, 99.99=337919] 
2024-08-28 11:20:19:428 730 sec: 31701078 operations; 41384.58 current ops/sec; est completion in 8 minutes [READ: Count=207187, Max=91647, Min=213, Avg=2432.25, 90=6379, 99=10191, 99.9=18415, 99.99=23455] [INSERT: Count=206575, Max=24111, Min=233, Avg=2395.07, 90=6355, 99=10151, 99.9=18319, 99.99=22751] 
2024-08-28 11:20:29:428 740 sec: 32149568 operations; 44849 current ops/sec; est completion in 8 minutes [READ: Count=223963, Max=60191, Min=192, Avg=2244.23, 90=5799, 99=9719, 99.9=18335, 99.99=21727] [INSERT: Count=224520, Max=22255, Min=231, Avg=2209.6, 90=5783, 99=9607, 99.9=18047, 99.99=21007] 
2024-08-28 11:20:39:428 750 sec: 32595530 operations; 44596.2 current ops/sec; est completion in 8 minutes [READ: Count=223179, Max=204415, Min=199, Avg=2277.42, 90=5763, 99=10887, 99.9=20255, 99.99=155903] [INSERT: Count=222832, Max=118079, Min=235, Avg=2203.25, 90=5755, 99=10759, 99.9=18927, 99.99=115327] 
2024-08-28 11:20:49:428 760 sec: 33052602 operations; 45707.2 current ops/sec; est completion in 8 minutes [READ: Count=228487, Max=380415, Min=199, Avg=2233.95, 90=5451, 99=9791, 99.9=19439, 99.99=333055] [INSERT: Count=228551, Max=325119, Min=234, Avg=2136.06, 90=5423, 99=9607, 99.9=18207, 99.99=318207] 
2024-08-28 11:20:59:430 770 sec: 33578643 operations; 52593.58 current ops/sec; est completion in 7 minutes [READ: Count=262575, Max=38751, Min=196, Avg=1918.96, 90=4711, 99=10447, 99.9=18255, 99.99=35455] [INSERT: Count=263524, Max=38751, Min=235, Avg=1880.41, 90=4639, 99=10415, 99.9=17871, 99.99=35903] 
2024-08-28 11:21:09:428 780 sec: 34135185 operations; 55665.33 current ops/sec; est completion in 7 minutes [READ: Count=278339, Max=200319, Min=205, Avg=1830.55, 90=3941, 99=9263, 99.9=20319, 99.99=178815] [INSERT: Count=278156, Max=164607, Min=234, Avg=1757.55, 90=3853, 99=9159, 99.9=18687, 99.99=127103] 
2024-08-28 11:21:19:428 790 sec: 34652793 operations; 51760.8 current ops/sec; est completion in 7 minutes [READ: Count=258501, Max=395007, Min=208, Avg=1975.45, 90=4127, 99=10327, 99.9=20495, 99.99=336127] [INSERT: Count=259093, Max=328447, Min=232, Avg=1883.66, 90=4069, 99=10151, 99.9=19263, 99.99=323327] 
2024-08-28 11:21:29:428 800 sec: 35141800 operations; 48900.7 current ops/sec; est completion in 7 minutes [READ: Count=244930, Max=38367, Min=213, Avg=2064.04, 90=4871, 99=9839, 99.9=17887, 99.99=22367] [INSERT: Count=244058, Max=24383, Min=248, Avg=2020.95, 90=4795, 99=9719, 99.9=17711, 99.99=21967] 
2024-08-28 11:21:39:428 810 sec: 35599890 operations; 45809 current ops/sec; est completion in 6 minutes [READ: Count=228843, Max=227967, Min=205, Avg=2225.85, 90=5191, 99=10791, 99.9=26719, 99.99=196479] [INSERT: Count=229273, Max=182783, Min=242, Avg=2136.03, 90=5111, 99=10311, 99.9=24239, 99.99=177151] 
2024-08-28 11:21:49:428 820 sec: 36091507 operations; 49161.7 current ops/sec; est completion in 6 minutes [READ: Count=245686, Max=354559, Min=206, Avg=2050.62, 90=4779, 99=9991, 99.9=18815, 99.99=300799] [INSERT: Count=245879, Max=292095, Min=236, Avg=2010.55, 90=4771, 99=9807, 99.9=18543, 99.99=289023] 
2024-08-28 11:21:59:428 830 sec: 36627275 operations; 53576.8 current ops/sec; est completion in 6 minutes [READ: Count=268094, Max=24783, Min=198, Avg=1884.36, 90=4439, 99=9615, 99.9=17263, 99.99=19263] [INSERT: Count=267691, Max=21567, Min=228, Avg=1845.59, 90=4343, 99=9399, 99.9=17103, 99.99=19119] 
2024-08-28 11:22:09:428 840 sec: 37159437 operations; 53216.2 current ops/sec; est completion in 6 minutes [READ: Count=265287, Max=203903, Min=207, Avg=1912.45, 90=4323, 99=9271, 99.9=18927, 99.99=174463] [INSERT: Count=266900, Max=169599, Min=238, Avg=1840.17, 90=4255, 99=8951, 99.9=17583, 99.99=166399] 
2024-08-28 11:22:19:428 850 sec: 37652572 operations; 49313.5 current ops/sec; est completion in 6 minutes [READ: Count=246613, Max=381439, Min=208, Avg=2058.32, 90=4683, 99=9919, 99.9=19935, 99.99=358143] [INSERT: Count=246734, Max=351487, Min=239, Avg=1993.86, 90=4635, 99=9719, 99.9=19263, 99.99=348159] 
2024-08-28 11:22:29:428 860 sec: 38167029 operations; 51445.7 current ops/sec; est completion in 5 minutes [READ: Count=256994, Max=74751, Min=209, Avg=1969.84, 90=4767, 99=10023, 99.9=18911, 99.99=43583] [INSERT: Count=257264, Max=24911, Min=236, Avg=1913.69, 90=4679, 99=9663, 99.9=17535, 99.99=23055] 
2024-08-28 11:22:39:428 870 sec: 38677821 operations; 51079.2 current ops/sec; est completion in 5 minutes [READ: Count=255470, Max=294399, Min=208, Avg=2009.13, 90=4311, 99=10159, 99.9=20367, 99.99=262143] [INSERT: Count=255360, Max=258047, Min=235, Avg=1901.99, 90=4239, 99=9431, 99.9=18415, 99.99=256895] 
2024-08-28 11:22:49:428 880 sec: 39179026 operations; 50120.5 current ops/sec; est completion in 5 minutes [READ: Count=251237, Max=402175, Min=186, Avg=2038.5, 90=4427, 99=9583, 99.9=20431, 99.99=382463] [INSERT: Count=249904, Max=374527, Min=221, Avg=1946.63, 90=4375, 99=9295, 99.9=18431, 99.99=372735] 
2024-08-28 11:22:59:428 890 sec: 39703815 operations; 52478.9 current ops/sec; est completion in 5 minutes [READ: Count=262578, Max=68415, Min=198, Avg=1925.56, 90=4555, 99=9735, 99.9=18143, 99.99=24943] [INSERT: Count=262202, Max=26479, Min=233, Avg=1880.6, 90=4463, 99=9487, 99.9=17647, 99.99=22063] 
2024-08-28 11:23:09:428 900 sec: 40229869 operations; 52605.4 current ops/sec; est completion in 5 minutes [READ: Count=263233, Max=211583, Min=212, Avg=1944.26, 90=4041, 99=10175, 99.9=22239, 99.99=181119] [INSERT: Count=262936, Max=175487, Min=238, Avg=1854.6, 90=3933, 99=9695, 99.9=19919, 99.99=173055] 
2024-08-28 11:23:19:428 910 sec: 40745756 operations; 51588.7 current ops/sec; est completion in 4 minutes [READ: Count=257785, Max=372223, Min=203, Avg=1999.36, 90=4455, 99=11871, 99.9=22127, 99.99=355071] [INSERT: Count=258087, Max=351231, Min=228, Avg=1871.92, 90=4255, 99=11239, 99.9=19151, 99.99=347903] 
2024-08-28 11:23:29:428 920 sec: 41278620 operations; 53286.4 current ops/sec; est completion in 4 minutes [READ: Count=266474, Max=100543, Min=202, Avg=1897.18, 90=4571, 99=9679, 99.9=18047, 99.99=41151] [INSERT: Count=266332, Max=36607, Min=236, Avg=1851.89, 90=4503, 99=9663, 99.9=17599, 99.99=34751] 
2024-08-28 11:23:39:428 930 sec: 41775857 operations; 49723.7 current ops/sec; est completion in 4 minutes [READ: Count=248866, Max=247423, Min=209, Avg=2067.27, 90=4375, 99=10735, 99.9=29887, 99.99=229503] [INSERT: Count=248361, Max=222207, Min=239, Avg=1949.93, 90=4287, 99=10135, 99.9=19583, 99.99=166399] 
2024-08-28 11:23:49:428 940 sec: 42264765 operations; 48890.8 current ops/sec; est completion in 4 minutes [READ: Count=244872, Max=378879, Min=209, Avg=2089.74, 90=4559, 99=10807, 99.9=20767, 99.99=359423] [INSERT: Count=244033, Max=353535, Min=238, Avg=1996.42, 90=4495, 99=10519, 99.9=19439, 99.99=306175] 
2024-08-28 11:23:59:428 950 sec: 42769969 operations; 50520.4 current ops/sec; est completion in 4 minutes [READ: Count=252624, Max=68095, Min=208, Avg=2009.6, 90=4411, 99=10295, 99.9=18399, 99.99=33055] [INSERT: Count=252619, Max=33727, Min=236, Avg=1945.03, 90=4319, 99=9727, 99.9=17711, 99.99=32431] 
2024-08-28 11:24:09:430 960 sec: 43246587 operations; 47652.27 current ops/sec; est completion in 3 minutes [READ: Count=237696, Max=232959, Min=210, Avg=2149.17, 90=4863, 99=11055, 99.9=24767, 99.99=203903] [INSERT: Count=238958, Max=140415, Min=228, Avg=2043.06, 90=4727, 99=10599, 99.9=20799, 99.99=96447] 
2024-08-28 11:24:19:428 970 sec: 43733004 operations; 48651.43 current ops/sec; est completion in 3 minutes [READ: Count=243477, Max=356095, Min=213, Avg=2136.19, 90=4667, 99=10343, 99.9=27903, 99.99=343039] [INSERT: Count=242867, Max=337919, Min=237, Avg=1970.39, 90=4523, 99=9503, 99.9=18543, 99.99=321023] 
2024-08-28 11:24:29:428 980 sec: 44262337 operations; 52933.3 current ops/sec; est completion in 3 minutes [READ: Count=264639, Max=56767, Min=197, Avg=1919.8, 90=4423, 99=10647, 99.9=18479, 99.99=24863] [INSERT: Count=264704, Max=25375, Min=229, Avg=1854.16, 90=4315, 99=10423, 99.9=18255, 99.99=23743] 
2024-08-28 11:24:39:428 990 sec: 44826923 operations; 56458.6 current ops/sec; est completion in 3 minutes [READ: Count=282586, Max=209279, Min=204, Avg=1828.63, 90=3803, 99=9903, 99.9=19327, 99.99=187391] [INSERT: Count=281990, Max=184703, Min=236, Avg=1708.96, 90=3613, 99=9295, 99.9=18783, 99.99=178431] 
2024-08-28 11:24:49:428 1000 sec: 45378074 operations; 55115.1 current ops/sec; est completion in 3 minutes [READ: Count=275955, Max=207231, Min=193, Avg=1878.33, 90=3855, 99=10095, 99.9=23103, 99.99=182783] [INSERT: Count=275224, Max=179455, Min=232, Avg=1745.8, 90=3657, 99=9519, 99.9=21039, 99.99=176255] 
2024-08-28 11:24:59:428 1010 sec: 45858393 operations; 48031.9 current ops/sec; est completion in 3 minutes [READ: Count=239793, Max=370943, Min=206, Avg=2168.97, 90=4803, 99=10271, 99.9=20863, 99.99=352767] [INSERT: Count=240518, Max=344575, Min=219, Avg=1990.58, 90=4615, 99=9327, 99.9=18495, 99.99=341759] 
2024-08-28 11:25:09:428 1020 sec: 46364362 operations; 50596.9 current ops/sec; est completion in 2 minutes [READ: Count=253349, Max=234367, Min=200, Avg=2044.97, 90=4635, 99=9351, 99.9=18239, 99.99=207743] [INSERT: Count=252612, Max=199935, Min=238, Avg=1903.54, 90=4439, 99=8999, 99.9=17119, 99.99=192767] 
2024-08-28 11:25:19:429 1030 sec: 46821322 operations; 45691.43 current ops/sec; est completion in 2 minutes [READ: Count=228649, Max=185471, Min=201, Avg=2264.73, 90=5415, 99=10511, 99.9=21199, 99.99=166271] [INSERT: Count=228317, Max=160767, Min=231, Avg=2108.05, 90=5147, 99=10007, 99.9=19999, 99.99=158847] 
2024-08-28 11:25:29:428 1040 sec: 47308059 operations; 48678.57 current ops/sec; est completion in 2 minutes [READ: Count=243444, Max=389375, Min=209, Avg=2142.36, 90=4703, 99=10055, 99.9=20063, 99.99=379391] [INSERT: Count=243235, Max=372479, Min=237, Avg=1960.98, 90=4471, 99=9295, 99.9=19087, 99.99=370175] 
2024-08-28 11:25:39:428 1050 sec: 47851332 operations; 54327.3 current ops/sec; est completion in 2 minutes [READ: Count=271439, Max=86207, Min=205, Avg=1880.04, 90=4139, 99=9375, 99.9=18303, 99.99=50239] [INSERT: Count=271823, Max=47615, Min=225, Avg=1741.86, 90=3891, 99=8727, 99.9=17983, 99.99=46623] 
2024-08-28 11:25:49:428 1060 sec: 48329072 operations; 47774 current ops/sec; est completion in 2 minutes [READ: Count=238261, Max=224255, Min=199, Avg=2212.85, 90=4739, 99=10263, 99.9=44063, 99.99=203775] [INSERT: Count=239533, Max=181759, Min=238, Avg=2032.85, 90=4487, 99=9815, 99.9=23359, 99.99=177023] 
2024-08-28 11:25:59:428 1070 sec: 48826573 operations; 49750.1 current ops/sec; est completion in 1 minute [READ: Count=248423, Max=427519, Min=216, Avg=2102.1, 90=4291, 99=9663, 99.9=20383, 99.99=408831] [INSERT: Count=249092, Max=406271, Min=237, Avg=1913.57, 90=4061, 99=8927, 99.9=18623, 99.99=403967] 
2024-08-28 11:26:09:428 1080 sec: 49331374 operations; 50480.1 current ops/sec; est completion in 1 minute [READ: Count=252570, Max=89535, Min=199, Avg=2047.54, 90=4571, 99=9815, 99.9=19935, 99.99=46335] [INSERT: Count=252212, Max=28319, Min=241, Avg=1909.98, 90=4331, 99=9175, 99.9=19279, 99.99=25583] 
2024-08-28 11:26:19:428 1090 sec: 49794659 operations; 46328.5 current ops/sec; est completion in 1 minute [READ: Count=232160, Max=194815, Min=209, Avg=2262.89, 90=4867, 99=11127, 99.9=25007, 99.99=190207] [INSERT: Count=231118, Max=180351, Min=222, Avg=2048.12, 90=4551, 99=10271, 99.9=18831, 99.99=175359] 
2024-08-28 11:26:29:428 1100 sec: 50306482 operations; 51182.3 current ops/sec; est completion in 1 minute [READ: Count=255308, Max=369407, Min=193, Avg=2054.15, 90=4375, 99=10911, 99.9=21503, 99.99=359167] [INSERT: Count=256516, Max=357631, Min=213, Avg=1849.43, 90=4063, 99=9839, 99.9=18527, 99.99=356351] 
2024-08-28 11:26:39:428 1110 sec: 50770217 operations; 46373.5 current ops/sec; est completion in 1 minute [READ: Count=231262, Max=88319, Min=213, Avg=2251.13, 90=5011, 99=10695, 99.9=20719, 99.99=56031] [INSERT: Count=232476, Max=27791, Min=244, Avg=2058.78, 90=4719, 99=9671, 99.9=18607, 99.99=26063] 
2024-08-28 11:26:49:428 1120 sec: 51188926 operations; 41870.9 current ops/sec; est completion in 1 minute [READ: Count=209807, Max=214271, Min=203, Avg=2496.21, 90=5927, 99=10839, 99.9=22735, 99.99=186239] [INSERT: Count=208895, Max=147967, Min=243, Avg=2275.01, 90=5647, 99=10311, 99.9=18159, 99.99=143103] 
2024-08-28 11:26:59:428 1130 sec: 51608605 operations; 41967.9 current ops/sec; est completion in 53 seconds [READ: Count=209879, Max=391935, Min=197, Avg=2494.29, 90=5851, 99=10735, 99.9=22655, 99.99=380671] [INSERT: Count=209809, Max=235135, Min=226, Avg=2266.35, 90=5579, 99=10111, 99.9=18703, 99.99=228223] 
2024-08-28 11:27:09:428 1140 sec: 52068512 operations; 45990.7 current ops/sec; est completion in 43 seconds [READ: Count=229683, Max=83775, Min=211, Avg=2251.73, 90=5239, 99=11527, 99.9=20863, 99.99=42559] [INSERT: Count=230225, Max=28655, Min=232, Avg=2092.94, 90=4931, 99=10991, 99.9=18991, 99.99=25535] 
2024-08-28 11:27:19:428 1150 sec: 52529001 operations; 46048.9 current ops/sec; est completion in 33 seconds [READ: Count=230025, Max=222719, Min=209, Avg=2283.07, 90=5103, 99=10935, 99.9=52415, 99.99=201599] [INSERT: Count=230473, Max=189439, Min=233, Avg=2055.73, 90=4791, 99=10295, 99.9=19935, 99.99=188799] 
2024-08-28 11:27:29:428 1160 sec: 53049806 operations; 52080.5 current ops/sec; est completion in 21 seconds [READ: Count=260466, Max=412927, Min=194, Avg=2028.68, 90=4427, 99=10327, 99.9=19183, 99.99=397823] [INSERT: Count=260335, Max=390911, Min=235, Avg=1806.59, 90=4055, 99=9439, 99.9=17903, 99.99=378879] 
2024-08-28 11:27:39:429 1170 sec: 53625252 operations; 57538.85 current ops/sec; est completion in 9 second [READ: Count=287534, Max=23343, Min=195, Avg=1825.03, 90=3807, 99=9175, 99.9=17535, 99.99=20479] [INSERT: Count=288013, Max=21695, Min=233, Avg=1646.79, 90=3481, 99=8295, 99.9=17119, 99.99=19999] 
Could not wait until max specified time, TerminatorThread interrupted.
2024-08-28 11:27:47:409 1177 sec: 54000000 operations; 46960.9 current ops/sec; [READ: Count=187477, Max=236287, Min=208, Avg=1927.63, 90=4081, 99=9951, 99.9=24831, 99.99=222591] [CLEANUP: Count=100, Max=8, Min=1, Avg=2.53, 90=4, 99=6, 99.9=8, 99.99=8] [INSERT: Count=187116, Max=216703, Min=240, Avg=1689.79, 90=3757, 99=9191, 99.9=18111, 99.99=181247] 
[OVERALL], RunTime(ms), 1177981
[OVERALL], Throughput(ops/sec), 45841.14684362481
[TOTAL_GCS_PS_Scavenge], Count, 2935
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 7617
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.64661484353313
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 22
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0018676022788143441
[TOTAL_GCs], Count, 2936
[TOTAL_GC_TIME], Time(ms), 7639
[TOTAL_GC_TIME_%], Time(%), 0.6484824458119444
[READ], Operations, 26993635
[READ], AverageLatency(us), 2118.176919670137
[READ], MinLatency(us), 186
[READ], MaxLatency(us), 427519
[READ], 95thPercentileLatency(us), 6687
[READ], 99thPercentileLatency(us), 10095
[READ], Return=OK, 26993635
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 2.53
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 8
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 6
[INSERT], Operations, 27006365
[INSERT], AverageLatency(us), 2066.0517259912617
[INSERT], MinLatency(us), 213
[INSERT], MaxLatency(us), 2054143
[INSERT], 95thPercentileLatency(us), 6643
[INSERT], 99thPercentileLatency(us), 9911
[INSERT], Return=OK, 27006365